apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_uart_type.h
/**************************************************************************//**
 * @file      rtl8710c_uart_type.h
 * @brief
 * @version   V1.00
 * @date      2018-1-4 15:41:32
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_UART_TYPE_H_
#define _RTL8710C_UART_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_UART_REG_TYPE

/**
 * @addtogroup hs_hal_uart_reg UART Registers.
 * @ingroup hs_hal_uart
 * @{
 */

/**
  \brief Union type to access uart_dll (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) Divisor Latch (LS) Register                                */
  
  struct {
    __IOM uint32_t dll        : 8;            /*!< [7..0] Baud rate divisor-low register, accessable only when
                                                   DLAB = 1                                                                  */
  } b;                                        /*!< bit fields for uart_dll */
} uart_dll_t, *puart_dll_t;

/**
  \brief Union type to access uart_dlm (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000004) Divisor Latch (MS) Register                                */
  
  struct {
    __IOM uint32_t dlm      : 8;            /*!< [7..0] Baud rate divisor-high register, accessable only when
                                                 DLAB = 1                                                                  */
  } b;                                        /*!< bit fields for uart_dlm */
} uart_dlm_t, *puart_dlm_t;

/**
  \brief Union type to access uart_ier (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000004) Interrupt Enable Register                                  */
  
  struct {
    __IOM uint32_t erbi     : 1;            /*!< [0..0] Enable Received Data Available Interrupt (ERBFI) (rx
                                                 trigger)                                                                  */
    __IOM uint32_t etbei    : 1;            /*!< [1..1] Enable Transmitter FIFO Empty interrupt (ETBEI) (tx fifo
                                                 empty)                                                                    */
    __IOM uint32_t elsi     : 1;            /*!< [2..2] Enable Receiver Line Status Interrupt (ELSI) (receiver
                                                 line status)                                                              */
    __IOM uint32_t edssi    : 1;            /*!< [3..3] Enable Modem Status Interrupt (EDSSI) (modem status transition)    */
  } b;                                        /*!< bit fields for uart_ier */
} uart_ier_t, *puart_ier_t;

/**
  \brief Union type to access uart_iir (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000008) Interrupt Identification Register                          */
  
  struct {
    __IM  uint32_t int_pend : 1;            /*!< [0..0] Indicates that an interrupt is pending when it's logic
                                                 0. When it is 1, no interrupt is pending                                  */
    __IM  uint32_t int_id   : 3;            /*!< [3..1] Bit1 and Bit2 the two bits of the IIR are used to identify
                                                 the highest priority interrupt pending as indicated in
                                                 the following table Bit3: In the FIFO mode this bit is
                                                 set along with bit 2 when a timeout interrupt is pending.                 */
  } b;                                        /*!< bit fields for uart_iir */
} uart_iir_t, *puart_iir_t;

/**
  \brief Union type to access uart_fcr (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000008) FIFO Control Register                                      */
  
  struct {
    __OM  uint32_t en_rxfifo_err : 1;       /*!< [0..0] Set as 1 to enable the report of Error in RCVR FIFO field
                                                 in LSR bit [7]                                                            */
    __OM  uint32_t clear_rxfifo : 1;        /*!< [1..1] Writing a Logic 1 to Bit 1 clears the Receiver FIFO and
                                                 resets its logic. But it doesn't clear the shift register.
                                                 The 1 that is written to this bit position is self-clearing.              */
    __OM  uint32_t clear_txfifo : 1;        /*!< [2..2] Write 1 to this bit clears the Transmitter FIFO and resets
                                                 its logic. But the shift register is not cleared, The 1
                                                 that is written to this bit position is self-clearing.                    */
    __OM  uint32_t dma_mode : 1;            /*!< [3..3] Support DMA mode. (cooperate with DW DDMA in the data
                                                 path)                                                                     */
    __IM  uint32_t          : 1;
    __IOM uint32_t txfifo_low_level : 1;    /*!< [5..5] Define the Transmission FIFO Low Water Level Interrupt
                                                 trigger. 0: 4 byte 1: 8 bytes                                             */
    __IOM uint32_t rxfifo_trigger_level : 2;/*!< [7..6] Define the 32-entries Receiver FIFO Interrupt trigger
                                                 level 0~31 bytes 00: 1 byte 01: 8 bytes 10: 16 bytes 11:
                                                 30 bytes (for some device detect RTS de-assertion slower,
                                                 reserve more RX FIFO space to prevent RX FIFO overflow
                                                 )                                                                         */
  } b;                                        /*!< bit fields for uart_fcr */
} uart_fcr_t, *puart_fcr_t;

/**
  \brief Union type to access uart_lcr (@ 0x0000000C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000000C) Line Control Register                                      */
  
