apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_uart_type.h
  struct {
    __IM  uint32_t d_cts      : 1;            /*!< [0..0] Delta Clear to Send (DCTS) indicator                               */
    __IM  uint32_t d_dsr      : 1;            /*!< [1..1] Delta Data Set Ready (DDSR) indicator                              */
    __IM  uint32_t teri       : 1;            /*!< [2..2] Trailing Edge of Ring Indicator (TERI) detector. The
                                                   RI line has changed its state from low to high state.                     */
    __IM  uint32_t d_dcd      : 1;            /*!< [3..3] Delta Data Carrier Detect (DDCD) indicator.                        */
    __IM  uint32_t r_cts      : 1;            /*!< [4..4] Complement of the CTS input or equals to RTS in loopback
                                                   mode.                                                                     */
    __IM  uint32_t r_dsr      : 1;            /*!< [5..5] Complement of the DSR input or equals to DTR in loopback
                                                   mode.                                                                     */
    __IM  uint32_t r_ri       : 1;            /*!< [6..6] Complement of the RI input or equals to Out1 in loopback
                                                   mode.                                                                     */
    __IM  uint32_t r_dcd      : 1;            /*!< [7..7] Complement of the DCD input or equals to Out2 in loopback
                                                   mode.                                                                     */
  } b;                                        /*!< bit fields for uart_msr */
} uart_msr_t, *puart_msr_t;

/**
  \brief Union type to access uart_scr (@ 0x0000001C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000001C) Scratch Pad Register                                       */
  
  struct {
    __IM  uint32_t            : 3;
    __IOM uint32_t pin_lb_test : 1;           /*!< [3..3] For uart IP txd/rxd/rts/cts pin loopback test                      */
    __IM  uint32_t fl_frame_err : 1;          /*!< [4..4] Frame error flag                                                   */
    __IM  uint32_t fl_set_bi_err : 1;         /*!< [5..5] set_bi_err flag                                                    */
    __IOM uint32_t rx_break_int_en : 1;       /*!< [6..6] Rx break signal interrupt enable                                   */
    __IOM uint32_t rx_break_int_sts : 1;      /*!< [7..7] Rx break signal interrupt status, write 1 to this bit
                                                   will clear the interrupt pending status                                   */
    __IOM uint32_t dbg_sel    : 4;            /*!< [11..8] Debug port selection                                              */
    __IM  uint32_t            : 4;
    __IOM uint32_t xfactor_adj : 11;          /*!< [26..16] The ovsr_adj, one of factors of baud rate calculation            */
  } b;                                        /*!< bit fields for uart_scr */
} uart_scr_t, *puart_scr_t;

/**
  \brief Union type to access uart_stsr (@ 0x00000020).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000020) STS Register                                               */
  
  struct {
    __IM  uint32_t            : 3;
    __IOM uint32_t reset_rcv  : 1;            /*!< [3..3] Reset Uart Receiver                                                */
    __IOM uint32_t xfactor    : 4;            /*!< [7..4] Factor of Baud rate calculation, the ovsr[3:0]                     */
    __IM  uint32_t            : 16;
    __IM  uint32_t dma_mode   : 1;            /*!< [24..24] dma_mode field of FCR bit[3]                                     */
    __IM  uint32_t fifo_en    : 1;            /*!< [25..25] fifo_en field of FCR bit[0]                                      */
    __IM  uint32_t txfifo_low_level : 1;      /*!< [26..26] txfifo_low_level in FCR bit[5], Define the Transmission
                                                   FIFO Low Water Level Interrupt trigger. 0: 4 byte 1: 8
                                                   bytes                                                                     */
    __IM  uint32_t rxfifo_trigger_level : 2;  /*!< [28..27] rxfifo_trigger_level in FCR bit[7:6], Define the 32-entries
                                                   Receiver FIFO Interrupt trigger level 0~31 bytes 00: 1
                                                   byte 01: 8 bytes 10: 16 bytes 11: 28 bytes (for some device
                                                   detect RTS de-assertion slower, reserve more RX FIFO space
                                                   to prevent RX FIFO overflow )                                             */
  } b;                                        /*!< bit fields for uart_stsr */
} uart_stsr_t, *puart_stsr_t;

/**
  \brief Union type to access uart_rbr (@ 0x00000024).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000024) Receiver Buffer Register                                   */
  
  struct {
    __IM  uint32_t rxdata   : 8;            /*!< [7..0] Rx data. Bit 0 is the least significant bit. It is the
                                                 first bit serially received.                                              */
  } b;                                        /*!< bit fields for uart_rbr */
} uart_rbr_t, *puart_rbr_t;

/**
  \brief Union type to access uart_thr (@ 0x00000024).
*/
typedef union {
  __OM  uint32_t w;                         /*!< (@ 0x00000024) Transmitter Holder Register                                */
  
  struct {
    __OM  uint32_t txdata   : 8;            /*!< [7..0] Tx data. Bit 0 is the least significant bit. It is the
                                                 first bit serially transmitted.                                           */
  } b;                                        /*!< bit fields for uart_thr */
} uart_thr_t, *puart_thr_t;

/**
  \brief Union type to access uart_miscr (@ 0x00000028).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) MISC Control Register                                      */
  
