apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_uart_type.h
  struct {
    __IOM uint32_t rf_mv1     : 8;            /*!< [7..0] The mask value for the 1st received byte.                          */
    __IOM uint32_t rf_mv2     : 8;            /*!< [15..8] The mask value for the 2nd received byte.                         */
  } b;                                        /*!< bit fields for uart_rfmvr */
} uart_rfmvr_t, *puart_rfmvr_t;

/**
  \brief Union type to access uart_rftor (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) RX Filter Timeout Register                                 */
  
  struct {
    __IOM uint32_t rf_timeout : 20;           /*!< [19..0] Set the timeout value of the RX filter idle detection.
                                                   This value is number of ticks. A tick time is equal to
                                                   a UART bit time.                                                          */
  } b;                                        /*!< bit fields for uart_rftor */
} uart_rftor_t, *puart_rftor_t;

/**
  \brief Union type to access uart_rflvr (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) RX FIFO Level Register                                     */
  
  struct {
    __IM  uint32_t rx_fifo_lv : 6;            /*!< [5..0] The level of the RX FIFO. This value indicates the number
                                                   of data bytes in the RX FIFO.                                             */
  } b;                                        /*!< bit fields for uart_rflvr */
} uart_rflvr_t, *puart_rflvr_t;

/**
  \brief Union type to access uart_tflvr (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) TX FIFO Level Register                                     */
  
  struct {
    __IM  uint32_t tx_fifo_lv : 5;            /*!< [4..0] The level of the TX FIFO. This value indicates the number
                                                   of data bytes in the TX FIFO.                                             */
  } b;                                        /*!< bit fields for uart_tflvr */
} uart_tflvr_t, *puart_tflvr_t;

/**
  \brief Union type to access uart_visr (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) Vendor Interrupt Status Register                           */
  
  struct {
    __IOM uint32_t rf_match_patt : 1;         /*!< [0..0] The interrupt status of RX filter pattern checking matched.
                                                   Write 1 to clear this interrupt status. 0: Interrupt is
                                                   not pending. 1: Interrupt is pending.                                     */
    __IOM uint32_t rf_timeout : 1;            /*!< [1..1] This bit indicates the interrupt pending status of the
                                                   RX filter timeout occurred. The RX idle detection mechanism
                                                   is used to check whether the receiving is in idle state
                                                   for re-aquire pattern matching. This mechanism uses a timer
                                                   to monitor new data receiving. This timer will reload the
                                                   initial value whenever a new byte is received. If the timeout
                                                   occurred (timer value countdown to 0), the RX filter will
                                                   be reset to the initialed state and restart the first received
                                                   1 or 2 bytes checking.                                                    */
    __IOM uint32_t tx_fifo_lv : 1;            /*!< [2..2] This bit indicates the interrupt pending status of the
                                                   TX FIFO water level equal to the level setting. The software
                                                   can use this interrupt to know the TX FIFO water level
                                                   is low and refill the TX FIFO. To enable this interrupt,
                                                   IER bit[5] should be written as 1. Write 1 to this bit
                                                   will clear the pending status.                                            */
    __IOM uint32_t rx_idle_timeout : 1;       /*!< [3..3] This bit indicate the receiver idle timeout interrupt
                                                   pending status. Write 1 to this bit will clear the pending
                                                   status.                                                                   */
  } b;                                        /*!< bit fields for uart_visr */
} uart_visr_t, *puart_visr_t;

/**
  \brief Union type to access uart_vier (@ 0x0000005C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000005C) Vendor Interrupt Enabling Control Register                 */
  
  struct {
    __IOM uint32_t rf_match_int_en : 1;       /*!< [0..0] The Rx filter pattern matched interrupt enabling control:
                                                   1: enable 0: disable                                                      */
    __IOM uint32_t rf_timeout_int_en : 1;     /*!< [1..1] The Rx filter idle timeout interrupt enabling control:
                                                   1: enable 0: disable                                                      */
    __IOM uint32_t tx_fifo_lv_int_en : 1;     /*!< [2..2] The TX FIFO water level interrupt enabling control: 1:
                                                   enable 0: disable                                                         */
    __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [3..3] The RX idle timeout interrupt enabling control: 1: enable
                                                   0: disable                                                                */
  } b;                                        /*!< bit fields for uart_vier */
} uart_vier_t, *puart_vier_t;

/**
  \brief Union type to access uart_ritor (@ 0x00000060).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000060) RX Idle Timeout Register                                   */
  
