apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_uart_type.h
  struct {
    __IOM uint32_t rxidle_timeout_value : 4;  /*!< [3..0] Time unit is the duration of a UART bit, depends on the
                                                   baud-rate setting. Default 0. 0: 8 bit time. (1*8) 1: 16
                                                   bit time. (2*8) 2: 32 bit time. (2^2*8) 3: 64 bit time.
                                                   (2^3*8) 4: 128 bit time. (2^4*8) 5: 256 bit time. (2^5*8)
                                                   6: 512 bit time. (2^6*8) 7: 1024 bit time. (2^7*8) 8: 2048
                                                   bit time. (2^8*8) 9: 4096 bit time. (2^9*8) 10: 8192 bit
                                                   time. (2^10*8) 11: 16384 bit time. (2^11*8) 12: 32768 bit
                                                   time. (2^12*8) 13: 65535 bit time. (2^13*8) 14: 131072
                                                   bit time. (2^14*8) 15: 262144 bit time. (2^15*8)                          */
    __IM  uint32_t            : 27;
    __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [31..31] RX idle timeout enable, default 0.                               */
  } b;                                        /*!< bit fields for uart_ritor */
} uart_ritor_t, *puart_ritor_t;

/** @} */ /* End of group ls_hal_uart_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_UART_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_UART_TYPE_H_

